In [1]:
import pandas as pd

import numpy as np

 

df = pd.DataFrame({

    'A': [1, np.nan, 3 , np.nan , 5 , np.nan],

    'B': [4, 5, 5 , 3 , np.nan , np.nan],

    'C': [7, 8, 9, np.nan , np.nan , np.nan]

})

 

df

     A    B    C
0  1.0  4.0  7.0
1  NaN  5.0  8.0
2  3.0  5.0  9.0
3  NaN  3.0  NaN
4  5.0  NaN  NaN
5  NaN  NaN  NaN

In [2]:
df.dropna()

     A    B    C
0  1.0  4.0  7.0
2  3.0  5.0  9.0

In [3]:
df.fillna(10)

      A     B     C
0   1.0   4.0   7.0
1  10.0   5.0   8.0
2   3.0   5.0   9.0
3  10.0   3.0  10.0
4   5.0  10.0  10.0
5  10.0  10.0  10.0

In [4]:
df.fillna(method="ffill")

C:\Users\waghm\AppData\Local\Temp\ipykernel_23672\3944122520.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill")

     A    B    C
0  1.0  4.0  7.0
1  1.0  5.0  8.0
2  3.0  5.0  9.0
3  3.0  3.0  9.0
4  5.0  3.0  9.0
5  5.0  3.0  9.0

In [6]:
df

     A    B    C
0  1.0  4.0  7.0
1  NaN  5.0  8.0
2  3.0  5.0  9.0
3  NaN  3.0  NaN
4  5.0  NaN  NaN
5  NaN  NaN  NaN

In [5]:
df.fillna(method="bfill")

C:\Users\waghm\AppData\Local\Temp\ipykernel_23672\3896554658.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="bfill")

     A    B    C
0  1.0  4.0  7.0
1  3.0  5.0  8.0
2  3.0  5.0  9.0
3  5.0  3.0  NaN
4  5.0  NaN  NaN
5  NaN  NaN  NaN

In [7]:
df.fillna(df.mean())

     A     B    C
0  1.0  4.00  7.0
1  3.0  5.00  8.0
2  3.0  5.00  9.0
3  3.0  3.00  8.0
4  5.0  4.25  8.0
5  3.0  4.25  8.0

In [9]:
df['A'].fillna(df['A'].mean())

0    1.0
1    3.0
2    3.0
3    3.0
4    5.0
5    3.0
Name: A, dtype: float64

In [11]:
df.fillna(df.median())

     A    B    C
0  1.0  4.0  7.0
1  3.0  5.0  8.0
2  3.0  5.0  9.0
3  3.0  3.0  8.0
4  5.0  4.5  8.0
5  3.0  4.5  8.0

In [4]:
import pandas as pd

 

df = pd.DataFrame({

    'A': [1, 2, 2, 2, 4,1,6,4,4,4,6,4],

    'B': ['x', 'y', 'y', 'y', 'z','x','y','a','a','a','c','z'],

    'C': [ 1,2,2,2,4,1,6,4,5,4,6,4]

})

df

    A  B  C
0   1  x  1
1   2  y  2
2   2  y  2
3   2  y  2
4   4  z  4
5   1  x  1
6   6  y  6
7   4  a  4
8   4  a  5
9   4  a  4
10  6  c  6
11  4  z  4

In [14]:
df.duplicated().sum()

5

In [5]:
print(df.duplicated().sum())

5

## Remove Duplicate

In [6]:
df.drop_duplicates()

    A  B  C
0   1  x  1
1   2  y  2
4   4  z  4
6   6  y  6
7   4  a  4
8   4  a  5
10  6  c  6

In [7]:
df.drop_duplicates(keep = "last")

    A  B  C
3   2  y  2
5   1  x  1
6   6  y  6
8   4  a  5
9   4  a  4
10  6  c  6
11  4  z  4

## Outlires in pandas 
only used numerical  column

In [8]:
import pandas as pd

import numpy as np

 

# Sample Data

data = {'Age': [19,20,21,18,14,23,24,100,95]}  # 120 and 150 are potential outliers

df = pd.DataFrame(data)

 

# Summary statistics

print(df.describe())

              Age
count    9.000000
mean    37.111111
std     34.381843
min     14.000000
25%     19.000000
50%     21.000000
75%     24.000000
max    100.000000

In [9]:
Q1= df.quantile(0.25)

In [10]:
Q3= df.quantile(0.75)

In [11]:
IQR = Q3-Q1

In [12]:
IQR

Age    5.0
dtype: float64

In [ ]:
LW = Q1 - 1.5 * IQR
print("lower wishker is :{LW})

In [13]:
df

   Age
0   19
1   20
2   21
3   18
4   14
5   23
6   24
7  100
8   95

In [14]:
lower_bound = Q1-1.5*IQR
upper_bound = Q3+1.5*IQR

In [15]:
print("lower wishker is :" , lower_bound)

print("upper wishker is :" , upper_bound)

lower wishker is : Age    11.5
dtype: float64
upper wishker is : Age    31.5
dtype: float64

In [16]:
outliers = df[(df['Age'] < lower_bound) | (df['Age'] > upper_bound)]


print(outliers)

ValueError: Can only compare identically-labeled Series objects

In [ ]:
Q1 = df['Age'].quantile(0.25)

Q3 = df['Age'].quantile(0.75)

IQR = Q3 - Q1

 

lower_bound = Q1 - 1.5 * IQR

upper_bound = Q3 + 1.5 * IQR

 

print("Lower Whisker:", lower_bound)

print("Upper Whisker:" ,upper_bound)

 

outliers = df[(df['Age'] < lower_bound) | (df['Age'] > upper_bound)]

print(outliers)

In [17]:
from scipy import stats

In [18]:
df['Z_score'] = np.abs(stats.zscore(df['Age']))

In [19]:
df

   Age   Z_score
0   19  0.558717
1   20  0.527868
2   21  0.497019
3   18  0.589567
4   14  0.712965
5   23  0.435320
6   24  0.404470
7  100  1.940086
8   95  1.785839

In [ ]:
# z = (x -U)/a

In [21]:
df.describe()

              Age   Z_score
count    9.000000  9.000000
mean    37.111111  0.827983
std     34.381843  0.594768
min     14.000000  0.404470
25%     19.000000  0.497019
50%     21.000000  0.558717
75%     24.000000  0.712965
max    100.000000  1.940086